using System.Text.RegularExpressions;
using System.Globalization;
using System.Reflection.Metadata.Ecma335;
using System.Linq;

namespace HomeworkATM
{
    internal class Program
    {
        static void Main(string[] args)
        {

            // изменения вносить было не сложно,
            // так как изначально переменные и названия методов были названы понятно,
            // в соответствии с их предназначением.
            // Сложностей с неочевидными связями между частями кода также не было,
            // так как были комментарии, поясняющие работу тех или иных частей кода

            var _card = new Card("1111111111111111", "Daria", "10.2025", "Sber", 15746);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card.cardNumber}");
            Console.WriteLine(_card.ToString());
            Console.WriteLine("----------------------------------------");
            var _card2 = new Card("1110311411115001", "Daria", "10.2029", "Tinkoff", 0);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card2.cardNumber}");
            Console.WriteLine(_card2.ToString());
            Console.WriteLine("----------------------------------------");

            
            var stack100 = new Stack<Banknote>();
            stack100.Push(new Banknote("100", "AB123456789"));
            stack100.Push(new Banknote("100", "AB176656789"));
            stack100.Push(new Banknote("100", "AB123454459"));
            stack100.Push(new Banknote("100", "AB002356789"));

            var stack10 = new Stack<Banknote>();
            stack10.Push(new Banknote("10", "AC123996789"));
            stack10.Push(new Banknote("10", "AC123000789"));
            stack10.Push(new Banknote("10", "AC133333789"));
            stack10.Push(new Banknote("10", "AC190900789"));

            var stack500 = new Stack<Banknote>();
            stack500.Push(new Banknote("500", "AD285644987"));
            stack500.Push(new Banknote("500", "AD111000789"));
            stack500.Push(new Banknote("500", "AD993333789"));
            stack500.Push(new Banknote("500", "AD000900789"));


            var dic = new Dictionary<string, Stack<Banknote>>();
            dic.Add("10", stack10);
            dic.Add("100", stack100);
            dic.Add("500", stack500);

            var transHistory = new List<string>();

            var _atm = new ATM("Sber", dic, transHistory, "74306199653196");
            Console.WriteLine("----------------------------------------");
            Console.WriteLine("ИНФОРМАЦИЯ ПРО ATM");
            Console.WriteLine(_atm.ToString());
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"Общее кол-во купюр в банкомате: {_atm.CashAmount()}");
            Console.WriteLine("----------------------------------------");

            var dicAdd = new Dictionary<string, Banknote>();
            dicAdd.Add("10", new Banknote("10", "AB123456798"));
            dicAdd.Add("100", new Banknote("100", "XY987654321"));
            dicAdd.Add("231", new Banknote("100", "MN246813579"));

            var dicAdd2 = new Dictionary<string, Banknote>();
            dicAdd2.Add("100", new Banknote("100", "EF111122229"));
            dicAdd2.Add("500", new Banknote("500", "AB123456799"));

            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ПОПОЛНЕНИЕ КАРТЫ {_card.cardNumber}:");
            Console.WriteLine("Сообщения от банкомата");
            _atm.ToppingUpCard(_card, dicAdd);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card.cardNumber}");
            Console.WriteLine(_card.ToString());
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ПОПОЛНЕНИЕ КАРТЫ {_card2.cardNumber}:");
            Console.WriteLine("Сообщения от банкомата");
            _atm.ToppingUpCard(_card2, dicAdd2);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card2.cardNumber}");
            Console.WriteLine(_card2.ToString());
            Console.WriteLine("----------------------------------------");

            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"СНЯТИЕ С КАРТЫ {_card.cardNumber}:");
            Console.WriteLine("Сообщения от банкомата");
            _atm.WithdrawalCard(_card, 500);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card.cardNumber}");
            Console.WriteLine(_card.ToString());
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"СНЯТИЕ С КАРТЫ {_card2.cardNumber}:");
            Console.WriteLine("Сообщения от банкомата");
            _atm.WithdrawalCard(_card2, 1500);
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"ИНФОРМАЦИЯ ПО КАРТЕ {_card2.cardNumber}");
            Console.WriteLine(_card2.ToString());
            Console.WriteLine("----------------------------------------");

            //Console.WriteLine(NewCrypt("1428394874562349"));

            _atm.Pickup("1428394874562349");
            Console.WriteLine("----------------------------------------");
            _atm.Pickup("1428394874562349");


            Console.WriteLine("----------------------------------------");
            Console.WriteLine("ИНФОРМАЦИЯ ПРО ATM");
            Console.WriteLine(_atm.ToString());
            Console.WriteLine("----------------------------------------");
            Console.WriteLine($"Общее кол-во купюр в банкомате: {_atm.CashAmount()}");
            Console.WriteLine("----------------------------------------");

        }
        


    }
}


/*
 ----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1111111111111111
Номер карты: 1111111111111111
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2025
Банк-эмитент карты: Sber
Сумма денег на счету: 15746

----------------------------------------
----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1110311411115001
Номер карты: 1110311411115001
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2029
Банк-эмитент карты: Tinkoff
Сумма денег на счету: 0

----------------------------------------
----------------------------------------
ИНФОРМАЦИЯ ПРО ATM
ID Банка: 2065338299
Банк, которому принадлежит банкомат: Sber
Секретный ключ для валидации инкассаторов: hahaha

----------------------------------------
Общее кол-во купюр в банкомате: 950000
----------------------------------------
----------------------------------------
ПОПОЛНЕНИЕ КАРТЫ 1111111111111111:
Сообщения от банкомата
System.Exception: Не найден данный номинал 231
----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1111111111111111
Номер карты: 1111111111111111
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2025
Банк-эмитент карты: Sber
Сумма денег на счету: 15946

----------------------------------------
ПОПОЛНЕНИЕ КАРТЫ 1110311411115001:
Сообщения от банкомата
Банк-эмитент карты не совпадает с банком, владеющим банкоматом. Вводится комиссия 5%
Банк-эмитент карты не совпадает с банком, владеющим банкоматом. Вводится комиссия 5%
Банк-эмитент карты не совпадает с банком, владеющим банкоматом. Вводится комиссия 5%
----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1110311411115001
Номер карты: 1110311411115001
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2029
Банк-эмитент карты: Tinkoff
Сумма денег на счету: 4275

----------------------------------------
----------------------------------------
СНЯТИЕ С КАРТЫ 1111111111111111:
Сообщения от банкомата
----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1111111111111111
Номер карты: 1111111111111111
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2025
Банк-эмитент карты: Sber
Сумма денег на счету: 15446

----------------------------------------
СНЯТИЕ С КАРТЫ 1110311411115001:
Сообщения от банкомата
Банк-эмитент карты не совпадает с банком, владеющим банкоматом. Вводится комиссия 5%
----------------------------------------
ИНФОРМАЦИЯ ПО КАРТЕ 1110311411115001
Номер карты: 1110311411115001
Имя владельца: Daria
Месяц и год окончания действия карты: 10.2029
Банк-эмитент карты: Tinkoff
Сумма денег на счету: 2850

----------------------------------------
КЛЮЧИ НЕ СОВПАДАЮТ! ПОЛИЦИЯ УЖЕ ЗА ДВЕРЬЮ!
----------------------------------------
КАССЕТА ИЗВЛЕЧЕНА
ИСТОРИЯ ТРАНЗАКЦИЙ БАНКОМАТА
1111111111111111: пополнение (100) => выполнено
1111111111111111: пополнение (100) => выполнено
1111111111111111: пополнение (462) => error
1110311411115001: пополнение (950 - комиссия 5%) => выполнено
1110311411115001: пополнение (950 - комиссия 5%) => выполнено
1110311411115001: пополнение (2375 - комиссия 5%) => выполнено
1111111111111111: снятие (500) => выполнено
1110311411115001: снятие (1425 - комиссия 5%) => выполнено
----------------------------------------
ИНФОРМАЦИЯ ПРО ATM
ID Банка: 2065338299
Банк, которому принадлежит банкомат: Sber
Секретный ключ для валидации инкассаторов: hahaha

----------------------------------------
Общее кол-во купюр в банкомате: 0
----------------------------------------

 */
